#include <stdio.h>


void main(){
	int i, a[10];
	for (i = 0; i<=9; i++){
		a[i] = i;
	}
	for (i =9; i >=0; i--){
		printf("%d\n", a[i]);
	}
}

//给数组赋值还可以初始化赋值和动态赋值
//初始值赋值一般是 类型说明赋 数组名[常量表达式]={值，值，值。。。}
//初始化赋值有很多种， int a[10] = {0, 1, 2, 3, 4,...}
void main(){
	int i, a[10] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
	for (i =9; i >=0; i--){
		printf("%d\n", a[i]);
	}
}

//可以只给一部分元素赋值， 比如int a[10]= {0, 1, 2, 3, 4};
//定义数组a有10个元素，但花括号里只有5个初始值，这表示只给钱5个元素赋初始值，后5个元素值为0
//如果想给全部赋值为0，可以一个一个写，也可以int a[10] = {0};不能一个都不赋值。
// 在对全部数组元素赋值时，由于数据的个数已经确定，因此可以不指定数组长度。
//比如int a[5]={1, 2, 3, 4, 5}; 也可以写成int a [] = {1, 2, 3, 4, 5};系统会自动计算



//动态赋值
void main(){
	int i, max, a[10];
	printf("input 10 numbers\n");
	for (i=0; i<10; i++)
		scanf("%d", &a[i]);
	max = a[0];
	for(i=1; i<10; i++)
		if(a[i]>max) max = a[i];
	printf("maxnum =%d\n", max);

}