#include <stdio.h>

//学习小组有5个人，每个人3个成绩，把所有数据保存到二维数组a[5][3]，然后求全组分科的平均成绩和总平均成绩
//分段赋值
// int a[5][3] = {{80, 75, 92},{61, 65, 67}, {59, 63, 70}, {85, 87, 90}, {76, 77, 85}};
void main(){
	int i, j, s =0, average, v[3];
	int a[5][3] = {{80, 75, 92},{61, 65, 67}, {59, 63, 70}, {85, 87, 90}, {76, 77, 85}};
	for(i=0; i<3; i++){  //表示科目
		for(j=0; j<5; j++)  //表示学生
			s = s+a[j][i];
		v[i]=s/5;
		s=0;
	}
	average = (v[0]+v[1]+v[2])/3;
	printf("math:%d\nclanguage:%d\ndFoxpro:%d\n", v[0],v[1], v[2]);
	printf("total:%d\n", average);
}



//二维数组的举例：将一个二维数组行和列互换，将a[2][3]转换为b[3][2]
//无论是多少维，先分解为一维



//有一个3x4的矩阵，要求编程求出其中值最大的那个元素的值以及所在的行号和列号



//从键盘输入9个整数，每行输入3个数字，保存在二维数组中，按数组原来位置输出第一行和第一列的所有元素